local Modules = game:GetService("CoreGui").RobloxGui.Modules

local AgreementPageType = require(Modules.LuaApp.Enum.AgreementPageType)

local privacyText1 = [[
腾讯游戏隐私保护指引

更新日期：2018年12月20 日
生效日期：2018年12月20 日

概要

欢迎您选择腾讯游戏！除《腾讯隐私政策》、《腾讯游戏许可及服务协议》外，我们还将通过《腾讯游戏隐私保护指引》（“本指引”）向您进一步细化说明您在使用腾讯游戏时我们收集、使用、存储和共享个人信息的情况，以及您所享有的相关权利等事宜，本指引是《腾讯游戏许可及服务协议》的组成部分，其中要点如下：
* 为了向您提供游戏娱乐以及与此相关的玩家互动、消费等服务，我们需要收集您的游戏历史、设备信息、登录日志等信息。
* 为更好地保护未成年人身心健康，促使未成年人健康上网，我们可能在国家有关网络游戏防沉迷政策规定的基础上，实施更为严格的防沉迷措施。同时我们也不断研究与测试各种保护未成年人的新技术。如为了进一步提高实名认证的精准度，最大限度防止未成年人冒用他人身份信息，我们可能在部分游戏或针对部分用户(以具体游戏策略为准)启用人脸识别验证。
上述人脸识别验证主要是将用户真实面部信息与公安权威数据平台数据源进行比对，如二者比对结果一致，即成功通过认证，并按用户实际年龄段匹配相应的游戏时限。如比对结果不符或用户拒绝验证，我们将统一视作12周岁及以下未成年人，纳入相应的防沉迷监管。人脸识别的相关验证数据，在加密后仅用于与公安权威数据平台进行比对，我们不会对其留存。
* 您可以根据本指引所述管理您的个人信息以及相关授权。
* 我们采用多方位的安全保护措施，以确保对您的个人信息保护处于合理的安全水平。
您可以通过阅读完整版《腾讯游戏隐私保护指引》，了解个人信息类型与用途的对应关系等更加详尽的个人信息处理规则。
1.我们收集的信息
2.信息的存储
3.信息的安全
4.我们如何使用信息
5.对外提供
6.您的权利
7.变更
8.未成年人保护
9.其他
10.联系我们

1.我们收集的信息
在您使用腾讯游戏服务的过程中，腾讯游戏会按照如下方式收集您在使用服务时主动提供的或因为使用服务而产生的信息，用以向您提供服务、优化我们的服务以及保障您的账户安全：
1.1 当您注册或使用腾讯游戏服务时，我们会收集您的网络身份标识信息及个人常用设备信息，用于标记您为腾讯游戏的用户。如果您使用微信或QQ关联登录腾讯游戏，我们会收集您微信或QQ的唯一标识、头像、昵称，用于保存您的登录信息，以便您在不同设备登录。
为了更好地向您提供游戏服务，改善游戏体验，腾讯可对您QQ帐号、微信账号或游戏账号中的昵称、头像以及在腾讯游戏中的相关操作信息、游戏信息等信息（以下称“该等信息”。该等信息具体包括但不限于您的登录状态、对战信息/状态、成就信息等）进行使用，并可向您本人或其他用户或好友展示该等信息。我们可能会视游戏产品具体情况为您提供相关权限，以便您可以对是否展示前述相关信息进行相应设置。
1.2 为满足相关法律法规政策及相关主管部门的要求，腾讯游戏用户需进行实名认证以继续使用和享受腾讯游戏。我们会在获得您同意或您主动提供的情况下收集您的实名身份信息，拒绝提供实名身份信息可能会导致您无法登陆腾讯游戏或在使用腾讯游戏过程中受到相应限制。
1.3 为保障您正常使用我们的服务，维护游戏基础功能的正常运行，优化游戏产品性能，提升您的游戏体验并保障您的账号安全，我们会收集您的设备ID、设备名称、设备类型和版本、系统版本、IP地址、MAC地址、应用ID、网络类型等信息。
1.4 当您使用腾讯游戏服务时，我们会收集您的游戏日志信息，例如登录日志、物品日志、游戏对局信息等，以便您能够在客户端查看您的游戏历史记录，同时用于游戏运营统计分析、客服投诉处理及其他游戏安全分析。
1.5 当您使用腾讯游戏产品的消费功能时，我们会收集您的充值记录、消费记录等信息，以便您查询您的交易记录，同时尽最大程度保护您的虚拟物品安全。收集上述信息为实现腾讯游戏产品的消费功能所必须，否则将无法完成交易。
1.6 为保障您的游戏账号安全，营造公平、健康及安全的游戏环境，我们会收集您的游戏识别信息、硬件及操作系统信息、进程及游戏崩溃记录等信息，以用于打击破坏游戏公平环境或干扰、破坏游戏服务正常进行的行为（如用于检测盗版、扫描外挂、防止作弊等）。
1.7 当您在游戏中通过文字、图片、语音、视频及其他方式与其他玩家进行互动，我们可能会收集并保存您发送的上述信息内容用于过滤色情、暴力、政治、辱骂、恶意广告等不当内容，以此净化游戏环境，维护健康的上网环境。
1.8 如您希望通过语音、视频与其他游戏玩家互动、参与直播，在您授权同意后，游戏会访问您的麦克风、摄像头，为您提供语音聊天、直播互动等功能。
1.9 如您希望与附近的游戏玩家互动，在您授权同意后，我们会收集您的地理位置信息，用于寻找附近的游戏玩家，以便您与附近的玩家匹配、组队等。地理位置信息属于敏感信息，拒绝提供该信息只会导致您无法实现与附近的游戏玩家互动，但不影响您正常使用腾讯游戏的其他功能，您也可以随时取消您的地理位置信息授权。
1.10 我们启用了适度游戏的提醒功能，如您使用可穿戴设备，我们会在征得您同意后收集您的游戏在线心跳等信息，以在您过度游戏时发出系统提醒。
1.11 根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用您的相关个人信息无需征求您的授权同意：
1） 与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公共知情等重大公共利益直接相关的；
2） 与犯罪侦查、起诉、审判和判决执行等直接相关的；
3） 出于维护您或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；
4） 所收集的个人信息是您自行向社会公众公开的；
5） 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
6） 根据您要求签订和履行合同所必需的；
7） 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
8） 为开展合法的新闻报道所必需的；
9） 出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
10） 法律法规规定的其他情形。
1.12 请您理解，我们向您提供的功能和服务是不断更新和发展的，如果某一功能或服务未在前述说明中且收集了您的信息，我们会通过页面提示、交互流程、网站公告等方式另行向您说明信息收集的内容、范围和目的，以征得您的同意。
目前，除了向第三方调研机构收集游戏调研信息，以帮助我们改进游戏产品以及提供个性化服务之外，我们不会主动从腾讯集团外的第三方获取您的个人信息。如未来为业务发展需要从腾讯集团外的第三方间接获取您的个人信息，我们会在获取前向您明示您个人信息的来源、类型及使用范围，如腾讯游戏开展业务需进行的个人信息处理活动超出您原本向腾讯集团外的第三方提供个人信息时的授权同意范围，我们将在处理您的该等个人信息前，征得您的明示同意；此外，我们也将会严格遵守相关法律法规的规定，并要求该第三方保障其提供的信息的合法性。

2.信息的存储
2.1 信息存储的方式和期限
我们会通过安全的方式存储您的信息，包括本地存储（例如利用APP进行数据缓存）、数据库和服务器日志。
一般情况下，我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您的个人信息。
2.2 信息存储的地域
我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。
2.3 产品或服务停止运营时的通知
当我们的产品或服务发生停止运营的情况时，我们将根据相关法律法规规定进行公告通知，并依法保障您的合法权益。

3.信息安全
3.1 安全保护措施
我们努力为用户的信息安全提供保障，以防止信息的泄露、丢失、不当使用、未经授权访问和披露等。我们使用多方位的安全保护措施，以确保用户的个人信息保护处于合理的安全水平，包括技术保护手段、管理制度控制、安全体系保障等诸多方面。此外，我们游戏的相关系统还通过了国家网络安全等级保护（三级）的备案和测评。
我们采用业界领先的技术保护措施。我们使用的技术手段包括但不限于防火墙、加密（例如SSL）、去标识化或匿名化处理、访问控制措施等。此外，我们还会不断加强安装在您设备端的软件的安全能力。例如，我们会在您的设备本地完成部分信息加密工作，以巩固安全传输；我们会了解您设备安装的应用信息和运行的进程信息，以预防病毒、木马等恶意程序。
我们建立了保障个人信息安全专门的管理制度、流程和组织。例如，我们严格限制访问信息的人员范围，要求他们遵守保密义务并进行审计，违反义务的人员会根据规定进行处罚。我们也会审查该管理制度、流程和组织，以防未经授权的人员擅自访问、使用或披露用户的信息。
我们建议您在使用产品和服务时充分注意对个人信息的保护，我们也会提供多种安全功能来协助您保护自己的个人信息安全。
3.2 安全事件处置措施
若发生个人信息泄露等安全事件，我们会启动应急预案，阻止安全事件扩大。安全事件发生后，我们会以公告、推送通知或邮件等形式告知您安全事件的基本情况、我们即将或已经采取的处置措施和补救措施，以及我们对您的应对建议。如果难以实现逐一告知，我们将通过公告等方式发布警示。

4.我们如何使用信息
我们严格遵守法律法规的规定以及与用户的约定，按照本指引及《腾讯游戏许可及服务协议》、《腾讯隐私政策》所述使用收集的信息，以向您提供更为优质的服务。
4.1 信息使用规则
我们会按照如下规则使用收集的信息：
1) 我们会根据我们收集的信息向您提供各项功能与服务，包括基础游戏功能、玩家互动功能、直播功能、消费功能等；
2) 我们会根据您的游戏等级、偏好、习惯、消费等特征为您提供个性化服务，包括基于特征标签进行间接人群画像并向您推荐您可能感兴趣的活动、比赛、促销等推广内容。
3) 我们会根据您使用腾讯游戏产品的频率和情况、故障信息、性能信息等分析我们产品的运行情况，以确保服务的安全性，并优化我们的产品，提高我们的服务质量。我们不会将我们存储在分析软件中的信息与您提供的个人身份信息相结合。
4.2 定向推送活动的规则
我们会根据您的游戏等级、偏好、习惯、消费等特征为您提供个性化的推广内容，例如向您推荐您可能喜欢的游戏皮肤。我们可能会视游戏产品具体情况为您提供相关权限，以便您可以通过相关设置降低推荐内容与您的相关性/退出此类个性化推送。
4.3 告知变动目的后征得同意的方式
我们将会在本指引所涵盖的用途内使用收集的信息。如我们使用您的个人信息，超出了与收集时所声称的目的及具有直接或合理关联的范围，我们将在使用您的个人信息前，再次向您告知并征得您的明示同意。

5.对外提供
目前，除本指引以及《腾讯游戏许可及服务协议》、《腾讯隐私政策》规定的情形之外，我们不会主动共享、提供或转让您的个人信息至腾讯集团外的第三方，如存在其他共享、提供或转让您的个人信息或您需要我们将您的个人信息共享、提供或转让至腾讯集团外的第三方情形时，我们会直接或确认该第三方征得您对上述行为的明示同意。
即使有前款规定，如果您使用的腾讯游戏的开发者为境外主体的，我们可能会将您在游戏中产生的记录或日志信息（如登陆日志、物品日志等）提供给境外的游戏开发者，用于游戏运营统计分析、客服投诉处理及其他游戏安全分析，帮助开发者完善游戏服务，进一步优化用户的游戏体验。另外，我们会在疑似未成年人消费后，尝试联系其监护人，将相关消费记录等信息告知其监护人，进行提醒、确认与处理。
除本指引以及《腾讯游戏许可及服务协议》、《腾讯隐私政策》另有规定外，我们不会对外公开披露所收集的个人信息。如必须公开披露时，我们会向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明示同意。
随着我们业务的持续发展，我们有可能进行合并、收购、资产转让等交易，我们将告知您相关情形，按照法律法规及不低于本指引所要求的标准继续保护或要求新的控制者继续保护您的个人信息。
另外，根据相关法律法规及国家标准，以下情形中，我们可能会共享、转让、公开披露个人信息无需事先征得您的授权同意：
1） 与国家安全、国防安全直接相关的；
2） 与公共安全、公共卫生、重大公共利益直接相关的；
3） 与犯罪侦查、起诉、审判和判决执行等直接相关的；
4） 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
5） 个人信息主体自行向社会公众公开个人信息的；
6） 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。

6.您的权利
在您使用腾讯游戏服务期间，我们可能会视游戏产品具体情况为您提供相应的操作设置，以便您可以查询、删除、更正或撤回您的相关个人信息，您可参考相应游戏产品的具体指引进行操作。此外，我们还设置了投诉举报渠道，您的意见将会得到及时的处理。
]]

local privacyText2 = [[
7.变更
我们可能会适时对本指引进行修订。当本指引的条款发生变更时，我们会在版本更新时以适当的方式向您提示变更后的指引。请您仔细阅读变更后的隐私保护指引或指引内容，您继续使用腾讯游戏表示您同意我们按照更新后的隐私保护指引收集、处理或使用您的个人信息。

8.未成年人保护
我们高度重视未成年人个人信息的保护问题，并持续探索更新的未成年人个人信息保护方式。
我们会积极按照国家防沉迷政策要求，通过启用防沉迷系统保护未成年人的合法权益。我们会通过实名身份等信息校验判断相关账号的实名信息是否为未成年人，进而决定是否将此账号纳入到防沉迷体系中。另外，我们会收集您的登录时间、游戏时长等信息，通过从系统层面自动干预和限制未成年人游戏时间、启用强制下线功能等方式，引导未成年人合理游戏，并在疑似未成年人消费后尝试联系其监护人进行提醒、确认与处理，帮助未成年人健康上网。
同时，为更好地保护未成年身心健康，促使未成年人健康上网，我们可能在国家有关网络游戏防沉迷政策规定的基础上，实施更为严格的防沉迷措施。同时我们也不断研究与测试各种保护未成年人的新技术。如为了进一步提高实名认证的精准度，最大限度防止未成年人冒用他人身份信息，我们可能在部分游戏或针对部分用户(以具体游戏策略为准)启用人脸识别验证。
上述人脸识别验证主要是将用户真实面部信息与公安权威数据平台数据源进行比对，如二者比对结果一致，即成功通过认证，并按用户实际年龄段匹配相应的游戏时限。如比对结果不符或用户拒绝验证，我们将统一视作12周岁及以下未成年人，纳入相应的防沉迷监管。人脸识别的相关验证数据，在加密后仅用于与公安权威数据平台进行比对，我们不会对其留存。
另外，我们还建立了成长守护平台。成长守护平台还可以帮助家长或监护人随时了解孩子的游戏情况，设置消费限额以及每天的游戏时长和时段，协助未成年人的家长或监护人保护未成年人免受不良游戏习惯的伤害。您可以点击这里了解更多有关腾讯游戏防沉迷系统和成长守护平台的介绍。同时，我们也建立了未成年人主动服务平台，在疑似未成年人消费后尝试联系其监护人进行提醒、确认与处理，您可以通过未成年教育咨询专线 0755-83761852与我们联系。
若您是未成年人的法定监护人，请您关注您所监护的未成年人是否是在取得您的授权同意之后使用腾讯游戏的服务或提供其个人信息。如果您对您所监护的未成年人的个人信息有疑问，请通过第10节中的联系方式与我们联系。

9.其他
《腾讯隐私政策》是腾讯统一适用的一般性隐私条款，其中所规定的内容包括但不限于用户权利及信息安全保障措施等均适用于腾讯游戏用户。如《腾讯隐私政策》与本指引存在不一致或矛盾之处，请以本指引为准。

10.联系我们
当您有其他的投诉、建议、未成年人个人信息相关问题时，请通过http://kf.qq.com/ 与我们联系。您也可以将您的问题发送至Dataprivacy@tencent.com或寄到如下地址：
中国广东省深圳市南山区科技中一路腾讯大厦 法务部 数据及隐私保护中心（收）
邮编：518057
我们将尽快审核所涉问题，并在验证您的用户身份后的三十天内予以回复。

腾讯公司
]]

local termsText1 = [[
腾讯游戏许可及服务协议

《腾讯游戏许可及服务协议》（以下简称“本协议”）由您与腾讯游戏服务提供方共同缔结，本协议具有合同效力。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制腾讯责任的条款（以下称“免责条款”）、对用户权利进行限制的条款（以下称“限制条款”）、约定争议解决方式和司法管辖的条款，以及开通或使用某项服务的单独协议。前述免责、限制及争议解决方式和管辖条款可能以黑体加粗、颜色标记或其他合理方式提示您注意，包括但不限于本协议第二条、第三条、第四条、第六条、第九条等相关条款，您对该等条款的确认将可能导致您在特定情况下的被动、不便、损失，请您在确认同意本协议之前或在使用腾讯游戏服务之前再次阅读前述条款。双方确认前述条款并非属于《合同法》第40条规定的“免除其责任、加重对方责任、排除对方主要权利的”的条款，并同意该条款的合法性及有效性。

除非您已阅读并接受本协议所有条款，否则您无权使用腾讯游戏服务。如果您对本协议或腾讯游戏服务有意见或建议，可与腾讯客户服务部门联系，我们会给予您必要的帮助。您点击同意、接受或下一步，或您注册、使用腾讯游戏服务均视为您已阅读并同意签署本协议。

如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。如您为未成年人法定监护人，希望合理设定孩子娱乐时间，培养孩子健康游戏习惯的，可依据相关规则登录腾讯游戏成长守护平台（https://jiazhang.qq.com/jz/home.html）了解相关信息，您使用腾讯游戏成长守护平台的，应遵守该平台上的《成长守护平台许可及服务协议》。

一、【定义】

1.1 本协议：指本协议正文、《腾讯服务协议》、《QQ号码规则》、《腾讯微信软件许可及服务协议》、《腾讯游戏隐私保护指引》、游戏规则及其修订版本。上述内容一经正式发布，即为本协议不可分割的组成部分。本协议同时还包括文化部根据《网络游戏管理暂行办法》（文化部令第49号）制定的《网络游戏服务格式化协议必备条款》。
1.2 游戏规则：指腾讯游戏服务提供方不时发布并修订的关于腾讯游戏的用户守则、玩家条例、游戏公告、提示及通知等内容。
1.3 腾讯游戏服务提供方：指向您提供腾讯游戏及其服务的深圳市腾讯计算机系统有限公司，在本协议中简称为“腾讯”。
1.4 腾讯游戏：指由腾讯负责运营的游戏的统称，包括计算机客户端游戏、网页游戏、HTML5游戏（H5游戏）、移动终端游戏、电视端游戏以及其他形式的游戏；腾讯游戏可能以软件形式提供，这种情况下，腾讯游戏还包括该相关软件及相关文档。
1.5 腾讯游戏服务：指腾讯向您提供的与游戏相关的各项在线运营服务。
1.6 您：又称“玩家”或“用户”，指被授权使用腾讯游戏及其服务的自然人。
1.7 游戏数据：指您在使用腾讯游戏过程中产生的被服务器记录的各种数据，包括但不限于角色数据、虚拟物品数据、行为日志、购买日志等等数据。

二、【游戏账号】

2.1 您如果需要使用和享受腾讯游戏，则您需要将您享有使用权的QQ账号或微信账号作为游戏账号，并按照文化部《网络游戏管理暂行办法》及《网络游戏服务格式化协议必备条款》的相关要求，登录实名注册系统并进行实名注册。您对该QQ号码和微信账号的申请、使用等行为应符合腾讯不时修订并公布的《腾讯服务协议》、《QQ号码规则》和《腾讯微信软件许可及服务协议》的规范。
您进行实名注册时，应提供有关您本人真实、合法、准确、有效的身份信息及其他相关信息，且不得以他人身份资料进行实名注册。否则，腾讯有权采取本协议第6.5条第二款规定的一种或多种处理措施，并可公布处理结果，因此造成的一切后果由您自行承担，且腾讯有权要求您赔偿因此给腾讯造成的所有损失。
2.2 您进一步知悉并同意，您在游客模式下可能无法进行游戏充值或消费。且一旦您卸载或重装腾讯游戏，或您更换手机、电脑等终端设备或该等终端设备损坏的，您在该游客模式下所有游戏相关数据可能都将会被清空，且无法查询和恢复。如因此造成您任何损失的，均由您自行承担。
如您使用腾讯认可的第三方帐号作为游戏账号使用和享受腾讯游戏的，您还应遵守有关该第三方帐号的协议、规则，且因该第三方帐号产生的相关问题包括但不限于被盗等，您应自行联系该第三方进行解决，腾讯可视情况提供相应的协助。
2.3 您充分理解并同意：为判断或核实您提供的相关实名注册信息是否真实或有效，腾讯有权将您提供的实名注册信息提供给第三方进行整理、保存及比对等处理。且腾讯会按照国家相关要求将您的实名注册信息运用于防沉迷系统之中，即腾讯可能会根据您的实名注册信息判断您是否年满18周岁、您提交的实名身份信息是否规范或实名验证是否通过等，从而决定是否对您的游戏账号予以防沉迷限制。
2.4 您充分理解并同意，腾讯有权审查用户注册所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障用户账号的安全、有效；用户有义务妥善保管其账号及密码，并正确、安全地使用其账号及密码。任何一方未尽上述义务导致账号密码遗失、账号被盗等情形而给用户和他人的民事权利造成损害的，应当承担由此产生的法律责任。
若您发现有他人冒用或盗用您的游戏账号及密码、或任何其他未经您合法授权使用的情形时，应立即以腾讯要求的有效方式通知腾讯并告知腾讯需采取的措施。您通知腾讯时，应提供与您注册身份信息相一致的个人有效身份信息，腾讯收到您的有效请求并核实身份后，会根据您的要求或结合具体情况采取相应措施（包括但不限于暂停该账号的登录和使用等），腾讯因根据您的请求采取相应措施而造成您及其他用户损失的，由您自行承担。若您没有提供有效身份信息或您提供的个人有效身份信息与所注册的身份信息不一致的，腾讯有权拒绝您的请求，因此造成您损失的，由您自行承担。
2.5 您充分理解并同意，为高效利用服务器资源，如果您3年内未使用游戏账号登录腾讯游戏，腾讯有权在提前通知的情况下，对该账号及其账号下的游戏数据及相关信息采取删除等处置措施。
2.6 您理解并同意，您不得将游戏账号以任何方式提供给他人使用，包括但不限于不得以转让、出租、借用等方式提供给他人作包括但不限于直播、录制、代打代练等商业性使用。否则，因此产生任何法律后果及责任均由您自行承担，且腾讯有权对您的游戏账号采取包括但不限于警告、限制或禁止使用游戏帐号全部或部分功能、删除游戏账号及游戏数据及其他相关信息、封号直至注销的处理措施，因此造成的一切后果由您自行承担。

三、【用户信息收集、使用及保护】
3.1 您同意并授权腾讯为履行本协议之目的收集您的用户信息，这些信息包括您在实名注册系统中注册的信息、您游戏账号下的游戏数据以及其他您在使用腾讯游戏服务的过程中向腾讯提供或腾讯基于安全、用户体验优化等考虑而需收集的信息，腾讯对您的用户信息的收集将遵循本协议及相关法律的规定。
3.2 您充分理解并同意：腾讯或其合作的第三方可以根据您的用户信息，通过短信、电话、邮件等各种方式向您提供关于腾讯游戏的活动信息、推广信息等各类信息。
3.3 您理解并同意：为了更好地向您提供游戏服务，改善游戏体验，腾讯可对您QQ帐号、微信账号或游戏账号中的昵称、头像以及在腾讯游戏中的相关操作信息、游戏信息等信息（以下称“该等信息”。该等信息具体包括但不限于您的登录状态、对战信息/状态、成就信息等）进行使用，并可向您本人或其他用户或好友展示该等信息。
3.4 您应对通过腾讯游戏及相关服务了解、接收或可接触到的包括但不限于其他用户在内的任何人的个人信息予以充分尊重，您不应以搜集、复制、存储、传播或以其他任何方式使用其他用户的个人信息，否则，由此产生的后果由您自行承担。
3.5 保护用户信息及隐私是腾讯的一项基本原则。除本协议另有规定外，腾讯游戏服务对用户信息收集、使用及保护等将遵循《腾讯游戏隐私保护指引》。
]]

local termsText2 = [[
四、【腾讯游戏服务】
4.1 在您遵守本协议及相关法律法规的前提下，腾讯给予您一项个人的、不可转让及非排他性的许可，以使用腾讯游戏服务。您仅可为非商业目的使用腾讯游戏服务，包括：
（1）接收、下载、安装、启动、升级、登录、显示、运行和/或截屏腾讯游戏；
（2）创建游戏角色，设置网名，查阅游戏规则、用户个人资料、游戏对局结果，开设游戏房间、设置游戏参数，在游戏中购买、使用游戏道具、游戏装备、游戏币等，使用聊天功能、社交分享功能；
（3）使用腾讯游戏支持并允许的其他某一项或几项功能。
4.2 您在使用腾讯游戏服务过程中不得未经腾讯许可以任何方式录制、直播或向他人传播腾讯游戏内容，包括但不限于不得利用任何第三方软件进行网络直播、传播等。
4.3 在腾讯游戏以软件形式提供的情况下，您在使用腾讯游戏及腾讯游戏服务时还应符合本协议第五条关于软件许可的规定。
4.4 本条及本协议其他条款未明示授权的其他一切权利仍由腾讯保留，您在行使这些权利时须另外取得腾讯的书面许可。
4.5 如果您违反本协议任何约定的，腾讯有权采取本协议第6.5条第二款规定的一种或多种处理措施，并可公布处理结果，且（/或）有权要求您赔偿因您违约行为而给腾讯造成的所有损失。
4.6 您充分理解并同意，腾讯有权依合理判断对违反有关法律法规或本协议规定的行为进行处理，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。
4.7 您充分理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；腾讯因此遭受损失的，您也应当一并赔偿。
4.8 您充分理解并同意：游戏道具、游戏装备、游戏币等是腾讯游戏服务的一部分，腾讯在此许可您依本协议而获得其使用权。您购买、使用游戏道具、游戏装备、游戏币等应遵循本协议、游戏具体规则的要求；同时，游戏道具、游戏装备、游戏币等可能受到一定有效期限的限制，即使您在规定的有效期内未使用，除不可抗力或可归责于腾讯的原因外，一旦有效期届满，将会自动失效。
您充分理解并同意：为更好地向用户提供腾讯游戏服务，腾讯有权对游戏中的任何内容或构成元素等作出调整、更新或优化（包括但不限于您购买或正在使用的角色、游戏装备及其他游戏道具的美术设计、性能及相关数值设置等作出调整、更新或优化等）。且如腾讯做出相应调整、更新或优化的，您同意不会因此追究腾讯的任何法律责任。
4.9 您充分理解并同意：为保障您游戏账号安全，为营造公平、健康及安全的游戏环境，在您使用腾讯游戏服务的过程中，在不违反相关法律规定情况下，腾讯可以通过技术手段了解您终端设备的随机存储内存以及与腾讯游戏同时运行的相关程序。一经发现有任何未经授权的、危害腾讯游戏服务正常运营的相关程序，腾讯可以收集所有与此有关的信息并采取合理措施予以打击。
4.10 您充分理解并同意：为了保证您及其他用户的游戏体验，腾讯有权转移或者清除腾讯游戏服务器上存储的一些过往的游戏数据。
4.11 腾讯将按照相关法律法规和本协议的规定，采取切实有效的措施保护未成年人在使用腾讯游戏服务过程中的合法权益，包括可能采取技术措施、禁止未成年人接触不适宜的游戏或者游戏功能、限制未成年人的游戏时间、预防未成年人沉迷网络。作为游戏规则的一部分，腾讯还将在适当位置发布腾讯游戏用户指引和警示说明，包括游戏内容介绍、正确使用游戏的方法以及防止危害发生的方法。所有未成年人用户都应在法定监护人的指导下仔细阅读并遵照执行这些指引和说明；其他玩家在使用腾讯游戏服务的过程中应避免发布、产生任何有损未成年人身心健康的内容，共同营造健康游戏环境。
4.12 您知悉并同意，出现以下情形之一的，腾讯有权将您的游戏账号纳入相应的防沉迷系统，采取相应的防沉迷措施：
（1）系统判断您未满18周岁的；或
（2）您提交的实名身份信息不规范的；或
（3）您实名验证未通过的；或
（4）游客模式登录的；或
（5）其他国家法律法规政策要求或腾讯有合理理由认为需要纳入防沉迷系统的情形的。
另外，为了进一步提高实名认证的精准度，最大限度防止未成年人冒用他人身份信息，我们可能在部分游戏或针对部分用户启用人脸识别验证。如腾讯游戏要求您进行人脸识别验证，而您未通过或拒绝的，我们也会将您的游戏账号纳入相应的防沉迷系统，采取相应的防沉迷措施。
对纳入相应防沉迷系统的游戏账号，我们有权依据国家有关法律法规及政策规定、本协议其他条款规定、腾讯游戏运营策略或根据您法定监护人的合理要求采取以下一种或多种措施：
（1）将与您游戏相关的信息（包括但不限于您游戏帐号的登录信息、充值流水信息等）提供给您的法定监护人，使得您法定监护人可及时或同步了解您游戏情况；
（2）限制您游戏账号的消费额度；
（3）采取技术措施屏蔽某些游戏或游戏的某些功能，或限定您游戏时间或游戏时长；
（4）注销或删除您游戏账号及游戏数据等相关信息；
（5）您法定监护人要求采取的，或腾讯认为可采取的其他合理措施，以限制或禁止您使用腾讯游戏；
（6）国家法律法规或政策要求的相关措施。
4.13 腾讯向用户提供游戏服务本身属于商业行为，用户有权自主决定是否根据腾讯自行确定的收费项目（包括但不限于购买游戏内的虚拟道具的使用权以及接受其他增值服务等各类收费项目）及收费标准支付相应的费用，以获得相应的游戏服务。如您不按相应标准支付相应费用的，您将无法获得相应的游戏服务。
您知悉并同意：收费项目或收费标准的改变、调整是一种正常的商业行为，您不得因为收费项目或收费标准的改变、调整而要求腾讯进行赔偿或补偿。
4.14 在任何情况下，腾讯不对因不可抗力导致的您在使用腾讯游戏服务过程中遭受的损失承担责任。该等不可抗力事件包括但不限于国家法律、法规、政策及国家机关的命令及其他政府行为或者其它的诸如地震、水灾、雪灾、火灾、海啸、台风、罢工、战争等不可预测、不可避免且不可克服的事件。
4.15 腾讯游戏可能因游戏软件BUG、版本更新缺陷、第三方病毒攻击或其他任何因素导致您的游戏角色、游戏道具、游戏装备及游戏币等账号数据发生异常。在数据异常的原因未得到查明前，腾讯有权暂时冻结该游戏账号；若查明数据异常为非正常游戏行为所致，腾讯有权恢复游戏账号数据至异常发生前的原始状态（包括向第三方追回被转移数据），且腾讯无须向您承担任何责任。
4.16 腾讯未授权您从任何第三方通过购买、接受赠与或者其他的方式获得游戏账号、游戏道具、游戏装备、游戏币等，腾讯不对第三方交易的行为负责，并且不受理因任何第三方交易发生纠纷而带来的申诉。
4.17 您充分理解到：不同操作系统之间存在不互通的客观情况，该客观情况并非腾讯造成，由此可能导致您在某一操作系统中的充值和游戏数据不能顺利转移到另一操作系统中。由于您在不同系统进行切换造成的充值损失和游戏数据丢失风险应由您自行承担，腾讯对此不承担任何责任。
4.18 您充分理解到：腾讯游戏中可能会设置强制对战区域或玩法，如果您不同意强制对战，请您不要进入该游戏或游戏区域；您的进入，将被视为同意该玩法并接受相应后果。
4.19 腾讯自行决定终止运营腾讯游戏时或腾讯游戏因其他任何原因终止运营时，腾讯会按照文化部有关网络游戏终止运营的相关规定处理游戏终止运营相关事宜，以保障用户合法权益。

五、【软件许可】
5.1 使用腾讯游戏服务可能需要下载并安装相关软件，您可以直接从腾讯的相关网站上获取该软件，也可以从得到腾讯授权的第三方获取。如果您从未经腾讯授权的第三方获取腾讯游戏或与腾讯游戏名称相同的游戏，将视为您未获得腾讯授权，腾讯无法保证该游戏能够正常使用，并对因此给您造成的损失不予负责。
5.2 腾讯可能为不同的终端设备或操作系统开发了不同的软件版本，包括但不限于windows、ios、android、windows phone、symbian、blackberry等多个应用版本，您应当根据实际情况选择下载合适的版本进行安装，下载安装程序后，您需要按照该程序提示的步骤正确安装。
5.3 若腾讯游戏以软件形式提供，腾讯给予您一项个人的、不可转让及非排他性的许可。您仅可为非商业目的在单一台终端设备上下载、安装、登录、使用该腾讯游戏。
5.4 为提供更加优质、安全的服务，在软件安装时腾讯可能推荐您安装其他软件，您可以选择安装或不安装。
5.5 如果您不再需要使用该软件或者需要安装新版，可以自行卸载。如果您愿意帮助腾讯改进产品服务，请告知卸载的原因。
5.6 为了保证腾讯游戏服务的安全性和功能的一致性，腾讯有权对软件进行更新，或者对软件的部分功能效果进行改变或限制。
5.7 软件新版本发布后，旧版本的软件可能无法使用。腾讯不保证旧版本软件继续可用及相应的客户服务，请您随时核对并下载最新版本。
]]

local termsText3 = [[
六、【用户行为规范】
6.1 您充分了解并同意，您必须为自己游戏账号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。
6.2 您除了可以按照本协议的约定使用腾讯游戏服务之外，不得进行任何侵犯腾讯游戏的知识产权的行为，或者进行其他的有损于腾讯或其他第三方合法权益的行为。
6.3 您在使用腾讯游戏或腾讯游戏服务时须遵守法律法规，不得利用腾讯游戏或腾讯游戏服务从事违法违规行为，包括但不限于以下行为：
（一）违反宪法确定的基本原则的；
（二）危害国家统一、主权和领土完整的；
（三）泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；
（四）煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；
（五）宣扬邪教、迷信的；
（六）散布谣言，扰乱社会秩序，破坏社会稳定的；
（七）宣扬淫秽、色情、赌博、暴力，或者教唆犯罪的；
（八）侮辱、诽谤他人，侵害他人合法权益的；
（九）违背社会公德的；
（十）有法律、行政法规和国家规定禁止的其他内容的。
6.4 除非法律允许或腾讯书面许可，您不得从事下列行为：
（1）删除游戏软件及其副本上关于著作权的信息；
（2）对游戏软件进行反向工程、反向汇编、反向编译或者以其他方式尝试发现软件的源代码；
（3）对游戏软件进行扫描、探查、测试，以检测、发现、查找其中可能存在的BUG或弱点；
（4）对游戏软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经合法授权的第三方工具/服务接入软件和相关系统；
（5）修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论上述行为是否为商业目的；
（6）通过非腾讯开发、授权的第三方软件、插件、外挂、系统，使用腾讯游戏及腾讯游戏服务，或制作、发布、传播非腾讯开发、授权的第三方软件、插件、外挂、系统；
（7）对游戏中腾讯拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
（8）建立有关腾讯游戏的镜像站点，或者进行网页（络）快照，或者利用架设服务器等方式，为他人提供与腾讯游戏服务完全相同或者类似的服务；
（9）将腾讯游戏的任意部分分离出来单独使用，或者进行其他的不符合本协议的使用；
（10）使用、修改或遮盖腾讯游戏的名称、商标或其它知识产权；
（11）其他未经腾讯明示授权的行为。
6.5 您在使用腾讯游戏服务过程中如有以下任何行为（以下也称“违法违规行为”）之一的，腾讯有权视情节严重程度，依据本协议及相关游戏规则的规定，对您采取本条第二款规定的一种或多种处理措施，并可公告处理结果：
（1）以某种方式暗示或伪称腾讯内部员工或某种特殊身份，企图得到不正当利益或影响其他用户权益的行为；
（2）在腾讯游戏中使用非法或不当词语、字符等，包括用于角色命名；
（3）以任何方式破坏腾讯游戏或影响腾讯游戏服务的正常进行；
（4）使用各种非法外挂行为；
（5）使用游戏同步器（具体包括但不限于使用键盘、鼠标等硬件同步器，以便可以使用一套键盘、鼠标，同时、同步控制多台电脑进行游戏的行为），以及使用其他各种可以让您在游戏效率或收益数据上表现异常的硬件（以下统称“作弊硬件”）；
（6）传播非法言论或不当信息；
（7）盗取他人游戏账号、游戏物品；
（8）进行游戏账号交易；
（9）未经腾讯许可，擅自进行游戏虚拟货币、游戏装备、游戏币及其他游戏道具等交易；
（10）违反本协议任何约定的，或违反国家法律法规任何规定的；
（11）其他在行业内被广泛认可的不当行为。
前款规定的处理措施包括但不限于：
（1）警告；及/或
（2）禁言，包括但不限于游戏全区禁言、单区禁言以及公共频道禁言；及/或
（3）内容重置，包括但不限于重置或强制修改您提供或上传的非法昵称、房间名、图片等非法信息或内容等；及/或
（4）减少或限制您的游戏收益，该游戏收益包括但不限于游戏中与游戏角色成长升级相关的所有数据（如经验值、荣誉值、声望值、称号等）的提升以及游戏中的道具、装备、虚拟货币等虚拟物品的获取；及/或
（5）删除或注销游戏账号、游戏数据或其他游戏相关信息；及/或
（6）限制或禁止您进入游戏中的特定场景或使用游戏特定功能；及/或
（7）强制退出游戏（即“踢出游戏”），包括但不限于强制退出整个游戏，或游戏中的单局对战，或您正在进行中的其他游戏行为；及/或
（8）暂时或永久性地禁止您游戏帐号登录腾讯游戏（以下称“封号”）；及/或
（9）暂时或永久性地禁止您违法违规行为涉及的特定终端（包括但不限于PC终端、移动终端等）登录腾讯游戏；及/或
（10）暂停或终止您使用腾讯游戏及相关服务，或单方通知您终止本协议；及/或
（11）就您的违法违规行为提起相应民事诉讼，追究您的侵权、违约或其他民事责任，并要求您赔偿腾讯公司因您违法违规行为所受到的损失（包括腾讯公司所受到的直接经济损失、名誉或商誉损失以及腾讯公司对外支付的赔偿金、和解费用、律师费用、诉讼费用及其他间接损失），或移交有关行政管理机关给予行政处罚，或者移交司法机关追究您的刑事责任；及/或
（12）腾讯通过游戏规则（包括但不限于用户守则、玩家条例、游戏公告、提示及通知）公布的其他处理措施。
您知悉并同意，由于外挂及游戏同步器等作弊硬件具有隐蔽性或用完后即消失等特点，腾讯有权根据您的游戏数据和表现异常判断您有无使用非法外挂或游戏同步器等作弊硬件行为。
6.6 您知悉并同意，如腾讯依据本协议对您的游戏账号采取封号处理措施的，具体封号期间由腾讯根据您违规行为情节而定。
您知悉并同意：（1）在封号期间，您游戏账号中的游戏虚拟货币、游戏装备、游戏币及其他游戏道具可能都将无法使用；（2）如前述游戏虚拟货币、游戏装备、游戏币及其他游戏道具存在一定有效期，该有效期可能会在封号期间过期，您游戏账号解封后，您将无法使用该等已过期的游戏虚拟货币、游戏装备、游戏币及其他游戏道具。据此，您也同意不会因发生前述第（1）和（或）第（2）点规定的情形而追究腾讯任何法律责任。

七、【知识产权】
7.1 腾讯是腾讯游戏的知识产权权利人。腾讯游戏（包括腾讯游戏整体及腾讯游戏涉及的所有内容、组成部分或构成要素 ）的一切著作权、商标权、专利权、商业秘密等知识产权及其他合法权益，以及与腾讯游戏相关的所有信息内容（包括文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，腾讯享有上述知识产权和合法权益，但相关权利人依照法律规定应享有的权利除外。未经腾讯事先书面同意，您不得以任何方式将腾讯游戏（包括腾讯游戏整体及腾讯游戏涉及的所有内容、组成部分或构成要素 ）进行商业性使用。
7.2 尽管本协议有其他规定，您在使用腾讯游戏服务中产生的游戏数据的所有权和知识产权归腾讯所有，腾讯有权保存、处置该游戏数据。其中，腾讯对用户购买游戏虚拟货币的购买记录的保存期限将遵守文化部《网络游戏管理暂行办法》有关规定。对其他游戏数据的保存期限由腾讯自行决定，但国家法律法规另有规定的从其规定。
7.3 腾讯游戏可能涉及第三方知识产权，而该等第三方对您基于本协议在腾讯游戏中使用该等知识产权有要求的，腾讯将以适当方式向您告知该要求，您应当一并遵守。

八、【遵守当地法律监管】
8.1 您在使用腾讯游戏服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。
8.2 您应避免因使用腾讯游戏服务而使腾讯卷入政治和公共事件，否则腾讯有权暂停或终止对您的服务。

九、【管辖与法律适用】
9.1 本协议签订地为中华人民共和国广东省深圳市南山区。
9.2 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
9.3 若您和腾讯之间因本协议发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交至本协议签订地有管辖权的人民法院管辖。
9.4 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
9.5 本协议条款无论因何种原因部分无效，其余条款仍有效，对各方具有约束力。

十、【其他】
10.1 腾讯有权在必要时变更本协议条款，您可以在腾讯游戏的相关页面查阅最新版本的协议条款。本协议条款变更后，如果您继续使用腾讯游戏服务，即视为您已接受变更后的协议。
10.2 根据国家新闻出版总署关于健康游戏的忠告，腾讯提醒您：抵制不良游戏，拒绝盗版游戏；注意自我保护，谨防受骗上当；适度游戏益脑，沉迷游戏伤身。

腾讯公司
]]

return {
	[AgreementPageType.Privacy] = {
		Title = "CommonUI.Features.Label.PrivacyPolicy",
		TextList = {
			privacyText1,
			privacyText2,
		}
	},
	[AgreementPageType.Terms] = {
		Title = "CommonUI.Features.Label.TermsOfService",
		TextList = {
			termsText1,
			termsText2,
			termsText3,
		}
	}
}